---
kind: method
id: M:Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Contains(Autodesk.Revit.DB.Electrical.DistributionSysType)
source: html/dd36bb62-fa09-ce05-301d-7c2def50f3cc.htm
---
# Autodesk.Revit.DB.Electrical.DistributionSysTypeSet.Contains Method

Tests for the existence of a DistributionSys type within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	DistributionSysType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.DistributionSysType`) - The DistributionSys type to be searched for.

## Returns
The Contains method returns True if the DistributionSys type is within the set, otherwise False.